000100001025     H*
000700210706     H***********************************************************************
000800001025     FMASTERL1IF  E           K        DISK
000900001025     F            ACTGLP                            KRENAMERPGID2
001000001025     C           *ENTRY    PLIST
001100001025     C                     PARM           CHECK   10
001200001025     C                     READ MASTERL1                 90
001300200903     C                     READ MASTERL1                 90
001400150826     C*
001500001025     C           CHECK     IFGT 1
001600001025     C                     GOTO ENDFIL
001700001025     C                     ENDIF
001800210510     C           CHECK     IFGT 2
001900210510     C                     GOTO ENDFIL
002000210510     C                     ENDIF
002100200922     C*
002200170724     C*
002300001025     C           ENDFIL    TAG
002400001025     C                     MOVE '1'       *INLR
002500001025     C                     RETRN
